let a =[2,5,13,18,44]

console.log(a.reverse())// Метод реверса выведет 44,18,13,5,2


let styles = [Джаз, Блюз]

styles.push("Рок-н-ролл")//Добавьте «Рок-н-ролл» в конец
styles[Math.floor((styles.length - 1) / 2)] = "Классика";//Замените значение в середине на «Классика». Ваш код для поиска значения в середине должен работать для массивов с любой длиной.
alert(styles.shift());//Удалите первый элемент массива и покажите его.
styles.unshift("Рэп", "Регги");//Вставьте «Рэп» и «Регги» в начало массива.

